In [3]:
# Imports
import pyspark
from pyspark.sql import SparkSession

simpleData = [(1,"James","Sales","NY",90000,34,10000), \
    (2,"Michael","Sales","NY",86000,56,20000), \
    (3,"Robert","Sales","CA",81000,30,23000), \
    (2,"Michael","Sales","NY",86000,56,20000), \
    (3,"Robert","Sales","CA",81000,30,23000),
    (4,"Maria","Finance","CA",90000,24,23000), \

  ]
columns= ["s.no","employee_name","department","state","salary","age","bonus"]
# Create SparkSession
spark = SparkSession.builder.appName("spark_sort").getOrCreate()
df1 = spark.createDataFrame(data = simpleData, schema = columns)
df1.printSchema()
df1.show(truncate=False)

root
 |-- s.no: long (nullable = true)
 |-- employee_name: string (nullable = true)
 |-- department: string (nullable = true)
 |-- state: string (nullable = true)
 |-- salary: long (nullable = true)
 |-- age: long (nullable = true)
 |-- bonus: long (nullable = true)

+----+-------------+----------+-----+------+---+-----+
|s.no|employee_name|department|state|salary|age|bonus|
+----+-------------+----------+-----+------+---+-----+
|1   |James        |Sales     |NY   |90000 |34 |10000|
|2   |Michael      |Sales     |NY   |86000 |56 |20000|
|3   |Robert       |Sales     |CA   |81000 |30 |23000|
|2   |Michael      |Sales     |NY   |86000 |56 |20000|
|3   |Robert       |Sales     |CA   |81000 |30 |23000|
|4   |Maria        |Finance   |CA   |90000 |24 |23000|
+----+-------------+----------+-----+------+---+-----+

In [4]:
    
import pyspark
from pyspark.sql import SparkSession

simpleData = [(5,"Raman","Finance","CA",99000,40,24000), \
    (6,"Scott","Finance","NY",83000,36,19000), \
    (7,"Jen","Finance","NY",79000,53,15000), \
    (8,"Jeff","Marketing","CA",80000,25,18000), \
    (5,"Raman","Finance","CA",99000,40,24000), \
    (6,"Scott","Finance","NY",83000,36,19000), \
    (9,"Kumar","Marketing","NY",91000,50,21000) \

  ]
columns= ["s.no","employee_name","department","state","salary","age","bonus"]
# Create SparkSession
spark = SparkSession.builder.appName("spark_sort").getOrCreate()
df2 = spark.createDataFrame(data = simpleData, schema = columns)
df2.printSchema()
df2.show(truncate=False)

root
 |-- s.no: long (nullable = true)
 |-- employee_name: string (nullable = true)
 |-- department: string (nullable = true)
 |-- state: string (nullable = true)
 |-- salary: long (nullable = true)
 |-- age: long (nullable = true)
 |-- bonus: long (nullable = true)

+----+-------------+----------+-----+------+---+-----+
|s.no|employee_name|department|state|salary|age|bonus|
+----+-------------+----------+-----+------+---+-----+
|5   |Raman        |Finance   |CA   |99000 |40 |24000|
|6   |Scott        |Finance   |NY   |83000 |36 |19000|
|7   |Jen          |Finance   |NY   |79000 |53 |15000|
|8   |Jeff         |Marketing |CA   |80000 |25 |18000|
|5   |Raman        |Finance   |CA   |99000 |40 |24000|
|6   |Scott        |Finance   |NY   |83000 |36 |19000|
|9   |Kumar        |Marketing |NY   |91000 |50 |21000|
+----+-------------+----------+-----+------+---+-----+

In [9]:
# union 
from pyspark.sql.functions import *
df = df1.union(df2)
df.show()

+----+-------------+----------+-----+------+---+-----+
|s.no|employee_name|department|state|salary|age|bonus|
+----+-------------+----------+-----+------+---+-----+
|   1|        James|     Sales|   NY| 90000| 34|10000|
|   2|      Michael|     Sales|   NY| 86000| 56|20000|
|   3|       Robert|     Sales|   CA| 81000| 30|23000|
|   2|      Michael|     Sales|   NY| 86000| 56|20000|
|   3|       Robert|     Sales|   CA| 81000| 30|23000|
|   4|        Maria|   Finance|   CA| 90000| 24|23000|
|   5|        Raman|   Finance|   CA| 99000| 40|24000|
|   6|        Scott|   Finance|   NY| 83000| 36|19000|
|   7|          Jen|   Finance|   NY| 79000| 53|15000|
|   8|         Jeff| Marketing|   CA| 80000| 25|18000|
|   5|        Raman|   Finance|   CA| 99000| 40|24000|
|   6|        Scott|   Finance|   NY| 83000| 36|19000|
|   9|        Kumar| Marketing|   NY| 91000| 50|21000|
+----+-------------+----------+-----+------+---+-----+

In [11]:
# unionAll
#from pyspark.sql.functions import unionAll
df3 = df1.unionAll(df2)
df3.show()

+----+-------------+----------+-----+------+---+-----+
|s.no|employee_name|department|state|salary|age|bonus|
+----+-------------+----------+-----+------+---+-----+
|   1|        James|     Sales|   NY| 90000| 34|10000|
|   2|      Michael|     Sales|   NY| 86000| 56|20000|
|   3|       Robert|     Sales|   CA| 81000| 30|23000|
|   2|      Michael|     Sales|   NY| 86000| 56|20000|
|   3|       Robert|     Sales|   CA| 81000| 30|23000|
|   4|        Maria|   Finance|   CA| 90000| 24|23000|
|   5|        Raman|   Finance|   CA| 99000| 40|24000|
|   6|        Scott|   Finance|   NY| 83000| 36|19000|
|   7|          Jen|   Finance|   NY| 79000| 53|15000|
|   8|         Jeff| Marketing|   CA| 80000| 25|18000|
|   5|        Raman|   Finance|   CA| 99000| 40|24000|
|   6|        Scott|   Finance|   NY| 83000| 36|19000|
|   9|        Kumar| Marketing|   NY| 91000| 50|21000|
+----+-------------+----------+-----+------+---+-----+

In [13]:
# if you want to remove the duplicate rows by discent
df3.distinct().show()

+----+-------------+----------+-----+------+---+-----+
|s.no|employee_name|department|state|salary|age|bonus|
+----+-------------+----------+-----+------+---+-----+
|   1|        James|     Sales|   NY| 90000| 34|10000|
|   2|      Michael|     Sales|   NY| 86000| 56|20000|
|   3|       Robert|     Sales|   CA| 81000| 30|23000|
|   4|        Maria|   Finance|   CA| 90000| 24|23000|
|   5|        Raman|   Finance|   CA| 99000| 40|24000|
|   6|        Scott|   Finance|   NY| 83000| 36|19000|
|   7|          Jen|   Finance|   NY| 79000| 53|15000|
|   8|         Jeff| Marketing|   CA| 80000| 25|18000|
|   9|        Kumar| Marketing|   NY| 91000| 50|21000|
+----+-------------+----------+-----+------+---+-----+

In [14]:
# if you want to remove the duplicate rows by dropDuplicates
df3.dropDuplicates().show()

+----+-------------+----------+-----+------+---+-----+
|s.no|employee_name|department|state|salary|age|bonus|
+----+-------------+----------+-----+------+---+-----+
|   1|        James|     Sales|   NY| 90000| 34|10000|
|   2|      Michael|     Sales|   NY| 86000| 56|20000|
|   3|       Robert|     Sales|   CA| 81000| 30|23000|
|   4|        Maria|   Finance|   CA| 90000| 24|23000|
|   5|        Raman|   Finance|   CA| 99000| 40|24000|
|   6|        Scott|   Finance|   NY| 83000| 36|19000|
|   7|          Jen|   Finance|   NY| 79000| 53|15000|
|   8|         Jeff| Marketing|   CA| 80000| 25|18000|
|   9|        Kumar| Marketing|   NY| 91000| 50|21000|
+----+-------------+----------+-----+------+---+-----+

In [15]:
# drop duplicate on department column data
df3.dropDuplicates(['department']).show()

+----+-------------+----------+-----+------+---+-----+
|s.no|employee_name|department|state|salary|age|bonus|
+----+-------------+----------+-----+------+---+-----+
|   4|        Maria|   Finance|   CA| 90000| 24|23000|
|   8|         Jeff| Marketing|   CA| 80000| 25|18000|
|   1|        James|     Sales|   NY| 90000| 34|10000|
+----+-------------+----------+-----+------+---+-----+

In [16]:
# drop duplicate on department column data
df3.dropDuplicates(['s.no']).show()

+----+-------------+----------+-----+------+---+-----+
|s.no|employee_name|department|state|salary|age|bonus|
+----+-------------+----------+-----+------+---+-----+
|   1|        James|     Sales|   NY| 90000| 34|10000|
|   2|      Michael|     Sales|   NY| 86000| 56|20000|
|   3|       Robert|     Sales|   CA| 81000| 30|23000|
|   4|        Maria|   Finance|   CA| 90000| 24|23000|
|   5|        Raman|   Finance|   CA| 99000| 40|24000|
|   6|        Scott|   Finance|   NY| 83000| 36|19000|
|   7|          Jen|   Finance|   NY| 79000| 53|15000|
|   8|         Jeff| Marketing|   CA| 80000| 25|18000|
|   9|        Kumar| Marketing|   NY| 91000| 50|21000|
+----+-------------+----------+-----+------+---+-----+